{
    "nav": {
        "inicio": "Home",
        "fechas": "Dates",
        "acerca": "About",
        "ponencias": "Conferences",
        "calls": "Calls",
        "precios": "Pricing",
        "talleres": "Workshops",
        "comite": "Local Committee",
        "contacto": "Contact",
        "signIn": "Sign In",
        "myAccount": "My Account",
        "ubicacion": "Location",
        "comite": "Committee"
    },
    "words": {
        "requirements": "Requirements: ",
        "see-more": "See more",
        "close": "Close",
        "about-conference": "About the conference"
    },
    "carousel": {
        "titulo": "International Congress",
        "dates": "August 6 - 9, 2019",
        "place": "Mexico City",
        "asistep": "Attends as speaker",
        "recep": "Call for papers open",
        "taller_interes": "Announcement",
        "calls": "If you belong to the polytechnic IPN and you a graduate student or you belong to SEPI and you want to be part of the organizing committe, send an email to CORECONGRESSCS@GMAIL.COM",
        "callw": "Calls for workshop",
        "attend": "Attends conferences",
        "coming": "Coming soon",
        "algoritmo": "Algorithm competition",
        "enroll": "Enroll",
        "smart": "Smart cities",
        "big": "Big Data",
        "more": "More Info",
        "robo": "Robotics",
        "open_labs": "Open Labs",
        "gallery": "Gallery",
        "more-pics": "Show all"
    },
    "date": {
        "titulo": "Dates",
        "fecha_titulo": "From June 24 to 26, 2019",
        "evento_1": "Call for papers",
        "evento_2": "Call for workshops (closed)",
        "evento_3": "Congress",
        "tl_1": "Call for papers open",
        "tl_2": "Paper submission deadline",
        "tl_1a": "Call for workshops (closed)",
        "tl_2a": "Workshop applications deadline",
        "tl_3": "Results",
        "tl_4": "Workshops",
        "tl_5": "Conferences",
        "fecha_1": "May 1, 2019",
        "fecha_2": "May 31, 2019",
        "fecha_2a": "Jun 30, 2019",
        "fecha_2b": "Jul 19, 2019",
        "fecha_3": "July 12, 2019",
        "fecha_4": "April 17, 2019",
        "fecha_5": "June 5, 2019",
        "fecha_6": "June 20, 2019",
        "fecha_7": "July 30 to August 5, 2019",
        "fecha_8": "August 6 to August 9, 2019",
        "fecha_9": "April 17",
        "fecha_10": "April 17",
        "fecha_11": "June 30"
    },
    "about": {
        "titulo": "About CORE",
        "texto_1": "CORE is an International Congress on Computing Science traditionally organized by students from the Computer Research Center (CIC-IPN) in Mexico City. This year the organizing committee is formed by members from others academic centers from the IPN and it has its doors open for national and international students who work in any computing area.",
        "texto_2": "Throughout the history of this congress, dozens of speakers of international stature have been presented, who coexist with experienced researchers who present their work to the scientific community through this meeting place.",
        "texto_3": "As we know the academic world requires spaces to present the advances in the different areas of knowledge; whether they are research that improves previous methods, that present new problems in which to apply existing knowledge, new ways of solving problems or new areas to be explored.",
        "texto_4": "It is precisely this need that has successfully covered, year after year, this recognized congress and which in the present edition seeks to fully fill through a high level congress that connects international keynote speakers, young researchers, industry, and university-level and post-graduate assistants. As well as the publication of the articles that pass the scientific and editorial scrutiny in the indexed journal Research in Computing Science ISSN 1870-4069."
    },
    "general": {
        "titulo_1": "30 Conferences",
        "titulo_2": "150 Hours of content",
        "titulo_3": "+500 Attendees",
        "titulo_4": "7 Competences and challenges",
        "titulo_5": "12 Workshops",
        "titulo_6": "80 Research works"
    },
    "gallery": {
      "titulo": "Gallery CORE 2019"
    },
    "presentations": {
        "titulo": "Keynote Speakers 2019",
        "investigacion": "Modularity in artificial biological brains (2015)"
    },
    "frase": {
        "frase": "Science of today is technology of tomorrow."
    },
    "pricing": {
        "title": "Pricing",
        "estatus": "Soon",
        "publico": "General Public",
        "ponente": "Speaker",
        "ptaller": "Workshop (each) / ",
        "erec": "Acknowledgment of attendance at IPN community conferences /",
        "sign": "Sign up",
        "comun": "IPN Community",
        "eponente": "Speaker / ",
        "ework": "Workshop (each) / ",
        "rec": "Acknowledgment of attendance at External community conferences /",
        "mesg1": "If you require an invoice, it must include fiscal data: RFC, company name and fiscal address.",
        "mesg2": "Present a copy of a valid IPN credential.",
        "mesg3": "Payments",
        "mesg4": "should be made directly to the bank with the account number and references.",
        "mesg5": "Cash payments will not be accepted on the days of the event.",
        "mesg6": "* IPN community cannot receive any invoice from the IPN, if you require invoice you must pay as general public, otherwise you will only receive a note."
    },
    "challenges": {
        "title": "Previous Workshops",
        "subtitle": "Workshop",
        "duration": "Workshop duration",
        "subtitle_1": "Architecture design of processor Lagarto RISC-V",
        "parrafo_1": "The course is oriented to development and understanding of the Lagarto I architecture developed by the CIC IPN. The participant will apply his knowledge in computer architecture, Verilog among others.",
        "subtitle_2": "Introduction to the development of exploits",
        "parrafo_2": "The main objective is that the student acquire the knowledge and necessary skills to be able to identify and exploit basic vulnerabilities in the software programming. Coming from bad practices of programming, making a software vulnerable to buffer overflow, heap overflow and format string attacks.",
        "subtitle_3": "Introduction to the development of mobile apps with augmented reality.",
        "parrafo_3": "Give the basics in the use of Unity and Vuforia, for the development of mobile apps on Android using AR.",
        "subtitle_4": "Detecting people in images using deep learning.",
        "parrafo_4": "In this 4 hours workshop, you'll re-train the neural model YOLO to recognize People, vehicles and other objects in the picture using COLAB. We Will explain the neural architecture YOLO wich is one of the Best ones to detect objects, you'll get to know the métricas used for the performance evaluación of detectors. You'll use a tool to tag your own pictures and get a rought understanding of how to train a deep neural network.",
        "subtitle_5": "Applications with Docker",
        "parrafo_5": "In this introductory course to Docker students will learn how to create, deploy and manage images and Docker containers. At the end of the course you will know how to use Docker to build applications quickly and execute them anywhere.",
        "subtitle_6": "Big Data in data science",
        "parrafo_6": "The participants will acquire the bases to continue his study in the field of data science and have opportunities in the development of projects in this area that currently has  great income offers for who those who know how to solve problems in this field",
        "subtitle_7": "First steps in R.O.S",
        "parrafo_7": "The participants become familiar with R.O.S and be able to create their own nodes. The benefit for the participants is to learn to use a tool that facilitates the development of prototypes in robotics which is used by most importante research centers in this area and which is shaping up to become an industry standard.",
        "subtitle_8": "Exploration for the Knowledge Discovery in Open Data",
        "parrafo_8": "Provide participants with a methodology within the Data Science for the analysis of information and make the discovery of knowledge through ETL and visualization tools, using open databases which can be of public or private domain.",
        "subtitle_9": "Deep analysis of Digital documents 2.0",
        "parrafo_9": "Human language is the most effective and complex means of communication. One of the challenges to be solved in this age of information and knowledge is the automatic treatment of language. The general objective of this workshop is to provide attendees with an intensive and accessible introduction to Artificial Intelligence, Computational Linguistics and related topics currently available. Using this concepts appropriately represents an opportunity niche for development of high-impact multidisciplinary works.",
        "subtitle_10": "IoT - Artificial Intelligence in Embedded systems",
        "parrafo_10": "It exists a great interest in the convergence between internet of things (IoT) and artificial intelligence (AI) in the industrial sector. In this workshop you will develop a solution with machine learning in hardware plattforms dedicated to IoT (Raspberry PI)."
    },
    "deep-learning": {
        "subtitle": "Detecting people in images using deep learning.",
        "ponente": "He is a teacher, researcher, scientist and enthusiast for spreading useful knowledge. Graduated by CINVESTAV-IPN as doctor (2015) and master in science (2007). Has 11 years of experience in teaching at a higher level, 4 years in research: has published 22 articles in conferences and international journals; Has directed more than 20 undergraduate, 6 master's and 7 doctoral students. His lines of research are artificial neural networks and autonomous mobile robot navigation.",
        "duration": "Thursday, August 1 from 10:00 to 14:00",
        "requirements": "Programming knowledge, particularly in python and have completed basic engineering math (first 2 semesters).",
        "workshop-duration": "Workshop schedule: ",
        "contact": "Contact:"
    },
    "augmented-reality": {
        "subtitle": "Introduction to the development of mobile apps with augmented reality.",
        "ponente": "Received the degree in Communications and Electronics Engineering from the School of Mechanical and Electrical Engineering (ESIME) of the National Polytechnic Institute (IPN), in 1992, the degree of Master in Computer Science Engineering and Doctor in Computer Science in the computing Research Center (CIC), in 1997 and 2007, respectively. Currently, he is a Research Professor, Program Coordinator and Head of the Research Department in Computer Science at the Computing Research Center (CIC-IPN), since March 2010.",
        "duration": "Tuesday, July 30 to Thursday, August 1 from 10:00 to 13:00",
        "requirements": "Basic programming knowledge, particularly in C#, object oriented programming.",
        "workshop-duration": "Workshop schedule: ",
        "contact": "Contact:"
    },
    "exploits": {
        "subtitle": "Introduction to the development of exploits",
        "ponente": "PHD student in Cybersecurity in The CIC -IPN.Has a master's degree in computer science with a specialty in Cybersecurity and has made a internship of Network security research at Osaka University in Japan. For several years has been a consultant in computer security for Private companies, as well as for governmental organizations, of the offensive and defensive side. Has acquired Certifications of companies such as IBM and Microsoft. Has also taught in various conferences, courses and workshops related to cyber security.",
        "duration": "Tuesday, July 30 from 10:00 to 17:00",
        "requirements": "Basic programming knowledge in C language.",
        "workshop-duration": "Workshop schedule: ",
        "contact": "Contact:"
    },
    "big-data": {
        "subtitle": "Big Data in data science",
        "ponente": "Dr. Jesus Manuel Olivares Ceja obtained his PhD in Computer Science in the CIC-IPN in 2002. In 1996 the Master's Degree in Computer Science at CINVESTAV, Mexico. In 1991 he obtained the title of Bachelor of Computer Science at the UPIICSA-IPN. Has published in magazines and memories of national and international congresses in their lines of Research. In addition to its activity in research and teaching, he worked as an independent consultant between 1985 and 2005.",
        "duration": "Tuesday, July 30 from 16:00 to 19:00",
        "requirements": "Basic programming, linux and database knowledge. Interest on Data Science area.",
        "workshop-duration": "Workshop schedule: ",
        "contact": "Contact:"
    },
    "lagarto": {
        "subtitle": "Architecture design of processor Lagarto RISC-V",
        "ponente": "Marco Antonio Ramírez Salinas Doctor in Computer Science (Technology and Computer Architecture). Is a full Professor at the Computing Research Center and collaborate in the laboratory of Microtechnology and Embedded Systems. He is interested in the development of embedded systems, computer architecture design and parallel computing for HPC.",
        "duration": "Tuesday, July 30 to Thursday, August 2 from 14:00 to 19:00",
        "requirements": "Knowledge on digital circuits.",
        "workshop-duration": "Workshop schedule: ",
        "contact": "Contact:"
    },
    "docker": {
        "subtitle": "Applications with Docker",
        "ponente": "Masters in Cybersecurity at the Autonomous University of Barcelona, Bachelor in Computer Science at the National Polytechnic Institute.",
        "duration": "Friday, August 2 to Monday, August 5 from 11:00 to 14:00",
        "requirements": "Experience in software delivery. Familiarity with the command line on Linux.",
        "workshop-duration": "Workshop schedule: ",
        "contact": "Contact:"
    },
    "ros-first-steps": {
        "subtitle": "First steps in R.O.S",
        "ponente": "Master of Science at CIC, with the thesis \"Development of a dynamically stable Two-wheel robot\" Undergraduate Degree in Communications and Electronics Engineering at National Polytechnic Institute of México.",
        "duration": "Wednesday, July 31 to Thursday, August 1 from 14:00 to 18:00",
        "requirements": "A computer with Ubuntu O.S installed per student, which has to has installed ROS Melodic Morenia, Geany IDE and Jupyter Notebook.",
        "workshop-duration": "Workshop schedule: ",
        "contact": "Contact:"
    },
    "open-data": {
        "subtitle": "Exploration for the Knowledge Discovery in Open Data",
        "ponente": "Studied at the School of Physics and Mathematics(ESFM), obtained the Master's degree in the Computer Section (now Department) of the CINVESTAV-IPN and obtained his PHD in Computer Science in the Computer Research Center of the I.P.N. (CIC-IPN) with the work entitled \"Latices and other structures to accelerate searches in Data Mining\" Since 1996 works in the CIC-IPN, and currently is the head of the Laboratory of Databases and Software Technology.",
        "duration": "Tuesday, July 30 to Monday, August 5 from 08:00 to 12:00",
        "requirements": "Computer with at least 8GB of RAM, disk space of at least half terabyte and 32-inch monitors (2 monitors desirable per person). Internet with bandwidth or an acceptable speed for downloading files larger than 1GB. Storage devices for data backup. Text editors: Notepad ++ or Sublime Text. XAMMP, MySQLFront, WEKA, Tableau, Knime, Spreadsheet, Apache Tomcat.",
        "workshop-duration": "Workshop schedule: ",
        "contact": "Contact:"
    },
    "digital-documents": {
        "subtitle": "Deep analysis of Digital documents 2.0",
        "ponente": "Full Time Research Professor,Member of System of National Researchers, CONACyT, Level II. Works at the Artificial Intelligence Laboratory Center for Computing Research National Polytechnic Institute, Mexico.",
        "duration": "Wednesday, July 31 from 09:00 to 18:00 and Thursday, August 1 from 09:00 to 14:00",
        "requirements": "Python programming, handling of libraries in Python, use of Jupyter Notebook.",
        "workshop-duration": "Workshop schedule: ",
        "contact": "Contact:"
    },
    "embedded-systems": {
        "subtitle": "IoT - Artificial Intelligence in Embedded systems",
        "ponente": "Master in Science at the Computer Research Center, Mechatronic Engineering at the Unidad Profesional Interdisciplinaria en Ingeniería y Tecnologías Avanzadas - National Polytechnic Institute, Mexico. Instructor in \"Dive in learning\" ",
        "duration": "Monday, August 5 from 09:00 to 13:00",
        "requirements": "Knowledge on basic electronics and programming.",
        "workshop-duration": "Workshop schedule: ",
        "contact": "Contact:"
    },
    "svetlana-toldova": {
        "about": "She has a PhD",
        "conference": "It will be amazing"
    },
    "marco-korner": {
        "about": "He has a PhD",
        "conference": "For research and development of machine learning methods, the availability of data in high quantity and quality is absolutely key. Data is needed for training complex models, as well as for their evaluation and analysis. The domain of computer vision does provide challenging problems and datasets to the machine learning community, enabling the development of systems showing excellent performance, often even outperforming human experts. Meanwhile, the remote sensing community, especially Earth observation, became an important stakeholder for machine learning methods, as more and more data sources became operational recently. The ESA Copernicus fleet of satellites, for instance, continuously provides optical data at a high geometric, spectral, and temporal resolution, as well as data of further orthogonal modalities, like radar or lidar measurements. In my talk, I will outline the triad of machine learning, computer vision, and remote sensing and motivate how they mutually benefit each other. For this purpose, I will exemplarily present latest research carried out at the Technical University of Munich (TUM) and the German Aerospace Center (DLR)."
    },
    "humberto-diaz": {
        "about": "Assistant Professor of the Faculty of Computer Engineering of the Technological University of Havana 'José Antonio Echeverría', CUJAE. He received his degree in Computer Engineering from CUJAE in 2006 and the title of Master in Applied Computing in 2019. In 2014 he received a Doctor's degree from the University of Alicante, Spain. He currently serves as Dean of the Faculty of Computer Engineering of CUJAE, since 2017. His research work focuses on cyber security, cryptographic algorithms, security in computer networks.",
        "conference": "At present, cyber space has experienced a high growth in all the elements that compose it, in particular the applications that support business processes and decision making in organizations. One of the most important resources in cyber space is data, so it is vital for companies to guarantee the quality of those used for their operations. Data Quality, as a discipline within informatics, is responsible for studying the contexts where problems may appear in the data, as well as the measurement and quality assurance. On the other hand, there are people inside and outside companies with capabilities to carry out attacks that could affect it. This conference addresses an approach to data security as an attribute of their quality. A new security context is defined where quality problems may arise; as well as a method, based on cryptographic mechanisms, resistant to attacks that will allow the measurement of this. The experimental results show the feasibility of the method in terms of execution time, with an increase in storage that can be assumed in the deployment of the system."
    },
    "martha-saldivar": {
        "about": "She has a PhD in Science, in specialities of Automatic Control and Informatic and its aplications",
        "conference": "The automatic control has as its origin the evolution of various technological tools for the acquisition, processing and transmission of data. Its study and application has contributed to universal recognition of its advantages and benefits associated with engineering, which is where it has one of its greatest applications due to the need to control a large number of variables of increasingly complex systems. In this presentation I will talk about some of the engineering challenges I have studied and for which solutions have been proposed based on control theory. Among them are the elimination of vibrations in oil well drilling systems, the evasion of regenerative chattering in the milling process and the monitoring of the point of maximum power in photovoltaic systems. It should be noted that the analysis of systems for the design and application of automatic control laws would not be possible without the development of information technologies."
    },
    "adolfo-guzman": {
        "about": "He has a PhD",
        "conference": "Faced with the pressure of the globalized world and with access to an increasing amount of data and documents, Data Science has emerged, a discipline of computing that is becoming stronger. Analyze large data sets (for example, news in the press, results of knowledge tests versus socio-economic and family status of the student, crimes committed in an area for several years, purchases in commercial establishments, epidemics, with their dead, sick , vaccinated and restored, twitter messages, typical jobs of migrants who return to the country, preferences of movies, drinks, junk food, ads on TV channels and internet versus purchases by viewers users ...) to extract useful conclusions. Find trends, deviations, anomalies, interesting situations, typical behaviors, in a sea of ​​data. What do the data tell us? \"Torture the data until they confess.\" Data science extensively exploits the tools of Artificial Intelligence (mechanical learning, classifiers, trend analysis), but requires solid knowledge of databases and the preparation of computer applications. Use also probability and statistics. People who finish a degree or computer or computer engineering and study this emerging discipline, will have a promising future as the number and diversity of applications and phenomena grows."
    },
    "manuel-jimenez": {
        "about": "He has a PhD",
        "conference": "It will be amazing"
    },
    "thilo-pionteck": {
        "about": "Thilo Pionteck is associate professor holding the chair for hardware-oriented computer science at the Otto-von-Guericke-Universität Magdeburg, Germany. He received his Diploma degree in 1999 and his Ph.D. (Dr.-Ing.) degree in Electrical Engineering from the Technische Universität Darmstadt, Germany. In 2008, he was appointed as assistant professor for Integrated Circuits and Systems at the Universität zu Lübeck. From 2012 to 2014, he was substitute of the Chair of Embedded Systems at the Technische Universität Dresden and of the Chair of Computer Engineering at the Technische Universität at  Hamburg-Harburg. His research work focuses on Network-on-Chips, adaptive system design, runtime reconfiguration, and hardware/software co-design. In 2015 he was appointed as professor of the Chair of Organic Computing at the Universität zu Lübeck with research focus on adaptive digital systems. In 2016 he was appointed to the Otto-von-Guericke Universität Magdeburg.dyna",
        "conference": "It will be amazing"
    },
    "comite": {
        "title": "Local Committee",
        "estatus": "In construction"
    },
    "contacto": {
        "titulo": "Contact",
        "info": "Organizer | Simulation and modeling laboratory",
        "boton": "core@cic.ipn.mx",
        "comiteo": "Local Committee",
        "redes": "Follow us"
    },
    "calls": {
        "titulo": "Calls",
        "articulos_titulo": "Call for papers",
        "articulos_texto_1": "All submitted papers will be reviewed by experts in each area evaluating originality, significance, quality and clarity. Participants are invited to submit their papers according to the calendar presented below.",
        "articulos_fechas": "Important dates",
        "articulos_fechas_1": "Call for papers open: May 01, 2019",
        "articulos_fechas_2": "Paper submission deadline: May 31, 2019",
        "articulos_fechas_2a": "Paper submission deadline: Jun 30, 2019",
        "articulos_fechas_2b": "Paper submission deadline: Jul 192, 2019",
        "articulos_fechas_3": "Results: July 12, 2019",
        "articulos_fechas_4": "Conferences: 6 - 9 August 2019",
        "articulos_titulo_2": "Submission of papers",
        "articulos_texto_2": "The accepted papers will be published in the indexed journal Research in Computer Science (ISSN 1870-4069)",
        "articulos_texto_3": "Items must be prepared according to Springer LNCS guidelines",
        "articulos_titulo_3": "Interesting topics",
        "articulos_li_1": "Software engineering and quality",
        "articulos_li_2": "Cyber security",
        "articulos_li_3": "Geographic information systems",
        "articulos_li_4": "Embedded systems and high performance computing",
        "articulos_li_5": "Computer simulation",
        "articulos_li_6": "Natural language processing",
        "articulos_li_7": "Automation and intelligent systems",
        "articulos_li_8": "Quantum computation",
        "articulos_li_9": "Artificial intelligence",
        "articulos_li_10": "Fuzzy logic and neural networks",
        "articulos_li_11": "Image processing and computer vision",
        "articulos_li_12": "Human-computer interaction",
        "articulos_li_13": "Big Data",
        "articulos_li_14": "Cloud Computing",
        "articulos_li_15": "Smart cities",
        "articulos_li_16": "Internet of things",
        "articulos_comentario": "* Topics are not limited",
        "articulos_descarga": "Download format for Paper",
        "articulos_boton": "Submit paper",

        "workshop_titulo": "Call for workshops (closed)",
        "workshop_texto_1": "The workshop must include the registration form, duration of the workshop, costs, material (if required) and presentation. The workshop will be considered depending on the available classrooms and the topic to be developed by the committee of this congress. The speakers are invited to submit their proposals according to the calendar presented below.",
        "workshop_fechas": "Important dates",
        "workshop_li_1": "Call for workshops open: April 17, 2019",
        "workshop_li_2": "Workshops application deadline: June 5, 2019",
        "workshop_li_3": "Results: June 20, 2019",
        "workshop_li_4": "Conferences: July 30 to August 5, 2019",
        "workshop_descarga": "Download file for the Workshop",
        "workshop_comentario_1": "Send to ",
        "workshop_comentario_2": "attaching the file."
    }
}






