{
    "nav": {
        "inicio": "Home",
        "fechas": "Dates",
        "acerca": "About",
        "ponencias": "Conferences",
        "calls": "Calls",
        "precios": "Pricing",
        "talleres": "Workshops",
        "comite": "Local Committee",
        "contacto": "Contact",
        "signIn": "Sign In",
        "myAccount": "My Account",
        "ubicacion": "Location",
        "comite": "Committee"
    },
    "words": {
        "requirements": "Requirements: ",
        "see-more": "See more",
        "close": "Close"
    },
    "carousel": {
        "titulo": "International Congress",
        "dates": "August 6 - 9, 2019",
        "place": "Mexico City",
        "asistep": "Attends as speaker",
        "recep": "Call for papers open",
        "taller_interes": "Announcement",
        "calls": "If you belong to the polytechnic IPN and you a graduate student or you belong to SEPI and you want to be part of the organizing committe, send an email to CORECONGRESSCS@GMAIL.COM",
        "callw": "Calls for workshop",
        "attend": "Attends conferences",
        "coming": "Coming soon",
        "algoritmo": "Algorithm competition",
        "enroll": "Enroll",
        "smart": "Smart cities",
        "big": "Big Data",
        "more": "More Info",
        "robo": "Robotics"
    },
    "date": {
        "titulo": "Dates",
        "fecha_titulo": "From June 24 to 26, 2019",
        "evento_1": "Call for papers",
        "evento_2": "Call for workshops (closed)",
        "evento_3": "Congress",
        "tl_1": "Call for papers open",
        "tl_2": "Paper submission deadline",
        "tl_1a": "Call for workshops (closed)",
        "tl_2a": "Workshop applications deadline",
        "tl_3": "Results",
        "tl_4": "Workshops",
        "tl_5": "Conferences",
        "fecha_1": "May 1, 2019",
        "fecha_2": "May 31, 2019",
        "fecha_2a": "Jun 30, 2019",
        "fecha_2b": "Jul 19, 2019",
        "fecha_3": "July 12, 2019",
        "fecha_4": "April 17, 2019",
        "fecha_5": "June 5, 2019",
        "fecha_6": "June 20, 2019",
        "fecha_7": "July 30 to August 5, 2019",
        "fecha_8": "August 6 to August 9, 2019",
        "fecha_9": "April 17",
        "fecha_10": "April 17",
        "fecha_11": "June 30"
    },
    "about": {
        "titulo": "About CORE",
        "texto_1": "CORE is an International Congress on Computing Science traditionally organized by students from the Computer Research Center (CIC-IPN) in Mexico City. This year the organizing committee is formed by members from others academic centers from the IPN and it has its doors open for national and international students who work in any computing area.",
        "texto_2": "Throughout the history of this congress, dozens of speakers of international stature have been presented, who coexist with experienced researchers who present their work to the scientific community through this meeting place.",
        "texto_3": "As we know the academic world requires spaces to present the advances in the different areas of knowledge; whether they are research that improves previous methods, that present new problems in which to apply existing knowledge, new ways of solving problems or new areas to be explored.",
        "texto_4": "It is precisely this need that has successfully covered, year after year, this recognized congress and which in the present edition seeks to fully fill through a high level congress that connects international keynote speakers, young researchers, industry, and university-level and post-graduate assistants. As well as the publication of the articles that pass the scientific and editorial scrutiny in the indexed journal Research in Computing Science ISSN 1870-4069."
    },
    "general": {
        "titulo_1": "30 Conferences",
        "titulo_2": "150 Hours of content",
        "titulo_3": "+500 Attendees",
        "titulo_4": "7 Competences and challenges",
        "titulo_5": "12 Workshops",
        "titulo_6": "80 Research works"
    },
    "conference": {
        "titulo_1": "Magistral - Modeling and Control based on Quaternions (2017)",
        "descripcion_1": "Dr Pedro Castillo from the University of Technology of Compiègne, France presented his most recent research on quadripopter control.",
        "titulo_2": "First Algorithm Competition (2014)",
        "descripcion_2": "A set of problems is chosen to challenge and develop the skills of the contestants.",
        "titulo_3": "Microarchitecture of the processor Lagarto I (2018)",
        "descripcion_3": "Workshop given by the MICROSE laboratory with the purpose of giving an instruction to the Lagarto processor, developed by the CIC IPN.",
        "titulo_4": "Cybersecurity: Capture the flag (2016)",
        "descripcion_4": "Tournament that tests hacking skills through different tests or challenges."
    },
    "presentations": {
        "titulo": "Keynote Speakers 2019",
        "investigacion": "Modularity in artificial biological brains (2015)"
    },
    "frase": {
        "frase": "Science of today is technology of tomorrow."
    },
    "pricing": {
        "title": "Pricing",
        "estatus": "Soon",
        "publico": "General Public",
        "ponente": "Speaker",
        "ptaller": "Workshop (each) / ",
        "erec": "Acknowledgment of attendance at IPN community conferences /",
        "sign": "Sign up",
        "comun": "IPN Community",
        "eponente": "Speaker / ",
        "ework": "Workshop (each) / ",
        "rec": "Acknowledgment of attendance at External community conferences /",
        "mesg1": "If you require an invoice, it must include fiscal data: RFC, company name and fiscal address.",
        "mesg2": "Present a copy of a valid IPN credential.",
        "mesg3": "Payments",
        "mesg4": "should be made directly to the bank with the account number and references.",
        "mesg5": "Cash payments will not be accepted on the days of the event.",
        "mesg6": "* IPN community cannot receive any invoice from the IPN, if you require invoice you must pay as general public, otherwise you will only receive a note."
    },
    "challenges": {
        "title": "Previous Workshops",
        "subtitle": "Workshop",
        "duration": "Workshop duration",
        "subtitle_1": "Architecture design of processor Lagarto RISC-V",
        "parrafo_1": "The course is oriented to development and understanding of the Lagarto I architecture developed by the CIC IPN. The participant will apply his knowledge in computer architecture, Verilog among others.",
        "subtitle_2": "Introduction to the development of exploits",
        "parrafo_2": "The main objective is that the student acquire the knowledge and necessary skills to be able to identify and exploit basic vulnerabilities in the software programming. Coming from bad practices of programming, making a software vulnerable to buffer overflow, heap overflow and format string attacks.",
        "subtitle_3": "Introduction to the development of mobile apps with augmented reality.",
        "parrafo_3": "Give the basics in the use of Unity and Vuforia, for the development of mobile apps on Android using AR.",
        "subtitle_4": "Detecting people in images using deep learning.",
        "parrafo_4": "In this 4 hours workshop, you'll re-train the neural model YOLO to recognize People, vehicles and other objects in the picture using COLAB. We Will explain the neural architecture YOLO wich is one of the Best ones to detect objects, you'll get to know the métricas used for the performance evaluación of detectors. You'll use a tool to tag your own pictures and get a rought understanding of how to train a deep neural network.",
        "subtitle_5": "Applications with Docker",
        "parrafo_5": "In this introductory course to Docker students will learn how to create, deploy and manage images and Docker containers. At the end of the course you will know how to use Docker to build applications quickly and execute them anywhere.",
        "subtitle_6": "Big Data in data science",
        "parrafo_6": "The participants will acquire the bases to continue his study in the field of data science and have opportunities in the development of projects in this area that currently has  great income offers for who those who know how to solve problems in this field",
        "subtitle_7": "First steps in R.O.S",
        "parrafo_7": "The participants become familiar with R.O.S and be able to create their own nodes. The benefit for the participants is to learn to use a tool that facilitates the development of prototypes in robotics which is used by most importante research centers in this area and which is shaping up to become an industry standard.",
        "subtitle_8": "Exploration for the Knowledge Discovery in Open Data",
        "parrafo_8": "Provide participants with a methodology within the Data Science for the analysis of information and make the discovery of knowledge through ETL and visualization tools, using open databases which can be of public or private domain.",
        "subtitle_9": "Deep analysis of Digital documents 2.0",
        "parrafo_9": "Human language is the most effective and complex means of communication. One of the challenges to be solved in this age of information and knowledge is the automatic treatment of language. The general objective of this workshop is to provide attendees with an intensive and accessible introduction to Artificial Intelligence, Computational Linguistics and related topics currently available. Using this concepts appropriately represents an opportunity niche for development of high-impact multidisciplinary works.",
        "subtitle_10": "IoT - Artificial Intelligence in Embedded systems",
        "parrafo_10": "It exists a great interest in the convergence between internet of things (IoT) and artificial intelligence (AI) in the industrial sector. In this workshop you will develop a solution with machine learning in hardware plattforms dedicated to IoT (Raspberry PI)."
    },
    "deep-learning": {
        "subtitle": "Detecting people in images using deep learning.",
        "ponente": "He is a teacher, researcher, scientist and enthusiast for spreading useful knowledge. Graduated by CINVESTAV-IPN as doctor (2015) and master in science (2007). Has 11 years of experience in teaching at a higher level, 4 years in research: has published 22 articles in conferences and international journals; Has directed more than 20 undergraduate, 6 master's and 7 doctoral students. His lines of research are artificial neural networks and autonomous mobile robot navigation.",
        "duration": "1 day, 4 hours",
        "requirements": "Programming knowledge, particularly in python and have completed basic engineering math (first 2 semesters).",
        "workshop-duration": "Workshop duration: ",
        "contact": "Contact:"
    },
    "augmented-reality": {
        "subtitle": "Introduction to the development of mobile apps with augmented reality.",
        "ponente": "Received the degree in Communications and Electronics Engineering from the School of Mechanical and Electrical Engineering (ESIME) of the National Polytechnic Institute (IPN), in 1992, the degree of Master in Computer Science Engineering and Doctor in Computer Science in the computing Research Center (CIC), in 1997 and 2007, respectively. Currently, he is a Research Professor, Program Coordinator and Head of the Research Department in Computer Science at the Computing Research Center (CIC-IPN), since March 2010.",
        "duration": "3 days, 3 hours each",
        "requirements": "Basic programming knowledge, particularly in C#, object oriented programming.",
        "workshop-duration": "Workshop duration: ",
        "contact": "Contact:"
    },
    "exploits": {
        "subtitle": "Introduction to the development of exploits",
        "ponente": "PHD student in Cybersecurity in The CIC -IPN.Has a master's degree in computer science with a specialty in Cybersecurity and has made a internship of Network security research at Osaka University in Japan. For several years has been a consultant in computer security for Private companies, as well as for governmental organizations, of the offensive and defensive side. Has acquired Certifications of companies such as IBM and Microsoft. Has also taught in various conferences, courses and workshops related to cyber security.",
        "duration": "1 day, 6 hours",
        "requirements": "Basic programming knowledge in C language.",
        "workshop-duration": "Workshop duration: ",
        "contact": "Contact:"
    },
    "big-data": {
        "subtitle": "Big Data in data science",
        "ponente": "Dr. Jesus Manuel Olivares Ceja obtained his PhD in Computer Science in the CIC-IPN in 2002. In 1996 the Master's Degree in Computer Science at CINVESTAV, Mexico. In 1991 he obtained the title of Bachelor of Computer Science at the UPIICSA-IPN. Has published in magazines and memories of national and international congresses in their lines of Research. In addition to its activity in research and teaching, he worked as an independent consultant between 1985 and 2005.",
        "duration": "5 days, 3 hours each",
        "requirements": "Basic programming, linux and database knowledge. Interest on Data Science area.",
        "workshop-duration": "Workshop duration: ",
        "contact": "Contact:"
    },
    "lagarto": {
        "subtitle": "Architecture design of processor Lagarto RISC-V",
        "ponente": "Marco Antonio Ramírez Salinas Doctor in Computer Science (Technology and Computer Architecture). Is a full Professor at the Computing Research Center and collaborate in the laboratory of Microtechnology and Embedded Systems. He is interested in the development of embedded systems, computer architecture design and parallel computing for HPC.",
        "duration": "5 days, 4 hours each",
        "requirements": "Knowledge on digital circuits.",
        "workshop-duration": "Workshop duration: ",
        "contact": "Contact:"
    },
    "docker": {
        "subtitle": "Applications with Docker",
        "ponente": "Masters in Cybersecurity at the Autonomous University of Barcelona, Bachelor in Computer Science at the National Polytechnic Institute.",
        "duration": "2 days, 2.5 hours each",
        "requirements": "Experience in software delivery. Familiarity with the command line on Linux.",
        "workshop-duration": "Workshop duration: ",
        "contact": "Contact:"
    },
    "ros-first-steps": {
        "subtitle": "First steps in R.O.S",
        "ponente": "Master of Science at CIC, with the thesis \"Development of a dynamically stable Two-wheel robot\" Undergraduate Degree in Communications and Electronics Engineering at National Polytechnic Institute of México.",
        "duration": "2 days, 4 hours each",
        "requirements": "A computer with Ubuntu O.S installed per student, which has to has installed ROS Melodic Morenia, Geany IDE and Jupyter Notebook.",
        "workshop-duration": "Workshop duration: ",
        "contact": "Contact:"
    },
    "open-data": {
        "subtitle": "Exploration for the Knowledge Discovery in Open Data",
        "ponente": "Studied at the School of Physics and Mathematics(ESFM), obtained the Master's degree in the Computer Section (now Department) of the CINVESTAV-IPN and obtained his PHD in Computer Science in the Computer Research Center of the I.P.N. (CIC-IPN) with the work entitled \"Latices and other structures to accelerate searches in Data Mining\" Since 1996 works in the CIC-IPN, and currently is the head of the Laboratory of Databases and Software Technology.",
        "duration": "5 days, 4 hours each",
        "requirements": "Computer with at least 8GB of RAM, disk space of at least half terabyte and 32-inch monitors (2 monitors desirable per person). Internet with bandwidth or an acceptable speed for downloading files larger than 1GB. Storage devices for data backup. Text editors: Notepad ++ or Sublime Text. XAMMP, MySQLFront, WEKA, Tableau, Knime, Spreadsheet, Apache Tomcat.",
        "workshop-duration": "Workshop duration: ",
        "contact": "Contact:"
    },
    "digital-documents": {
        "subtitle": "Deep analysis of Digital documents 2.0",
        "ponente": "Full Time Research Professor,Member of System of National Researchers, CONACyT, Level II. Works at the Artificial Intelligence Laboratory Center for Computing Research National Polytechnic Institute, Mexico.",
        "duration": "2 days, 5 hours each",
        "requirements": "Python programming, handling of libraries in Python, use of Jupyter Notebook.",
        "workshop-duration": "Workshop duration: ",
        "contact": "Contact:"
    },
    "embedded-systems": {
        "subtitle": "IoT - Artificial Intelligence in Embedded systems",
        "ponente": "Master in Science at the Computer Research Center, Mechatronic Engineering at the Unidad Profesional Interdisciplinaria en Ingeniería y Tecnologías Avanzadas - National Polytechnic Institute, Mexico. Instructor in \"Dive in learning\" ",
        "duration": "1 day, 4 hours",
        "requirements": "Knowledge on basic electronics and programming.",
        "workshop-duration": "Workshop duration: ",
        "contact": "Contact:"
    },
    "comite": {
        "title": "Local Committee",
        "estatus": "In construction"
    },
    "contacto": {
        "titulo": "Contact",
        "info": "Organizer | Simulation and modeling laboratory",
        "boton": "core@cic.ipn.mx",
        "comiteo": "Local Committee",
        "redes": "Follow us"
    },
    "calls": {
        "titulo": "Calls",
        "articulos_titulo": "Call for papers",
        "articulos_texto_1": "All submitted papers will be reviewed by experts in each area evaluating originality, significance, quality and clarity. Participants are invited to submit their papers according to the calendar presented below.",
        "articulos_fechas": "Important dates",
        "articulos_fechas_1": "Call for papers open: May 01, 2019",
        "articulos_fechas_2": "Paper submission deadline: May 31, 2019",
        "articulos_fechas_2a": "Paper submission deadline: Jun 30, 2019",
        "articulos_fechas_2b": "Paper submission deadline: Jul 192, 2019",
        "articulos_fechas_3": "Results: July 12, 2019",
        "articulos_fechas_4": "Conferences: 6 - 9 August 2019",
        "articulos_titulo_2": "Submission of papers",
        "articulos_texto_2": "The accepted papers will be published in the indexed journal Research in Computer Science (ISSN 1870-4069)",
        "articulos_texto_3": "Items must be prepared according to Springer LNCS guidelines",
        "articulos_titulo_3": "Interesting topics",
        "articulos_li_1": "Software engineering and quality",
        "articulos_li_2": "Cyber security",
        "articulos_li_3": "Geographic information systems",
        "articulos_li_4": "Embedded systems and high performance computing",
        "articulos_li_5": "Computer simulation",
        "articulos_li_6": "Natural language processing",
        "articulos_li_7": "Automation and intelligent systems",
        "articulos_li_8": "Quantum computation",
        "articulos_li_9": "Artificial intelligence",
        "articulos_li_10": "Fuzzy logic and neural networks",
        "articulos_li_11": "Image processing and computer vision",
        "articulos_li_12": "Human-computer interaction",
        "articulos_li_13": "Big Data",
        "articulos_li_14": "Cloud Computing",
        "articulos_li_15": "Smart cities",
        "articulos_li_16": "Internet of things",
        "articulos_comentario": "* Topics are not limited",
        "articulos_descarga": "Download format for Paper",
        "articulos_boton": "Submit paper",

        "workshop_titulo": "Call for workshops (closed)",
        "workshop_texto_1": "The workshop must include the registration form, duration of the workshop, costs, material (if required) and presentation. The workshop will be considered depending on the available classrooms and the topic to be developed by the committee of this congress. The speakers are invited to submit their proposals according to the calendar presented below.",
        "workshop_fechas": "Important dates",
        "workshop_li_1": "Call for workshops open: April 17, 2019",
        "workshop_li_2": "Workshops application deadline: June 5, 2019",
        "workshop_li_3": "Results: June 20, 2019",
        "workshop_li_4": "Conferences: July 30 to August 5, 2019",
        "workshop_descarga": "Download file for the Workshop",
        "workshop_comentario_1": "Send to ",
        "workshop_comentario_2": "attaching the file."
    }
}






